quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_gcr_regs.h
/*
 * mml_gcr_regs.h --
 *
 * ----------------------------------------------------------------------------
 * Copyright (c) 2014, Maxim Integrated Products
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the <organization> nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY MAXIM INTEGRATED PRODUCTS ''AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL MAXIM INTEGRATED PRODUCTS BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* [INTERNAL] ------------------------------------------------------------------
 * Created on: June 05, 2014
 * Author: Jeremy B. <jeremy.brodt@maximintegrated.com>
 *
 * ---- Subversion keywords (need to set the keyword property)
 * $Revision: 4561 $:  Revision of last commit
 * $Author: robert.muchsel $:  Author of last commit
 * $Date: 2015-01-16 17:42:05 -0600 (Fri, 16 Jan 2015) $:  Date of last commit
 * [/INTERNAL] -------------------------------------------------------------- */

#ifndef _MML_GCR_REGS_H_
#define _MML_GCR_REGS_H_

/** @file mml_gcr_regs.h GCR Registers Header */

/** @defgroup MML_GCR GCR Driver
 * @ingroup MML_DRIVER
 *
 * */

/** @defgroup MML_GCR_REGS GCR Registers
 *
 *
 *
 * @ingroup MML_GCR
 * @{
 */


/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_SCON GCR System Control Register
 *
 * @li 0 BSTAPEN: TAP Disable Bit
 * @li 2-1 RFU
 * @li 3 VBATSW: Battery supply source flag
 * @li 4 FLASH_PAGE_FLIP: Flips~ the Flash bottom and top halves (depending on total Flash size, each half is either 256KB or 512KB)
 * @li 12-5 RFU
 * @li 13 CCHK: Compute ROM Checksum. This bit is self-cleared when calculation is completed. 
 * @li 14 CHKRD: ROM Checksum Ready
 * @li 15 CHKRES: ROM Checksum Result. 
 * @{
 */

#define MML_GCR_SCON_OFST						0x00000000 //!< SCON register offset
#define MML_GCR_SCON_DFLT						0x00000001 //!< SCON register default value

#define MML_GCR_SCON_BSTAPEN_OFST				0 //!< BSTAPEN bits offset
#define MML_GCR_SCON_BSTAPEN_MASK_NOOFST		0x1 //!< BSTAPEN mask
#define MML_GCR_SCON_BSTAPEN_MASK				( MML_GCR_SCON_BSTAPEN_MASK_NOOFST << MML_GCR_SCON_BSTAPEN_OFST ) //!< BSTAPEN mask

#define MML_GCR_SCON_BSTAPEN_ENABLE				1 //! Disable JTAG TAP pins and allows them to be used as GPIO.

#define	MML_GCR_SCON_ONVMAIN_OFST				3
#define	MML_GCR_SCON_ONVMAIN_MASK_NOOFST		0x1
#define	MML_GCR_SCON_ONVMAIN_MASK				( MML_GCR_SCON_ONVMAIN_MASK_NOOFST << MML_GCR_SCON_ONVMAIN_OFST )

#define	MML_GCR_SCON_FLASH_PAGE_FLIP_OFST		4
#define	MML_GCR_SCON_FLASH_PAGE_FLIP_MASK_NOOFST	0x1
#define	MML_GCR_SCON_FLASH_PAGE_FLIP_MASK		( MML_GCR_SCON_FLASH_PAGE_FLIP_MASK_NOOFST << MML_GCR_SCON_FLASH_PAGE_FLIP_OFST )

#define	MML_GCR_SCON_CCHK_OFST					13
#define	MML_GCR_SCON_CCHK_MASK_NOOFST			0x1
#define	MML_GCR_SCON_CCHK_MASK					( MML_GCR_SCON_CCHK_MASK_NOOFST << MML_GCR_SCON_CCHK_OFST )

#define	MML_GCR_SCON_CHKRD_OFST					14
#define	MML_GCR_SCON_CHKRD_MASK_NOOFST			0x1
#define	MML_GCR_SCON_CHKRD_MASK					( MML_GCR_SCON_CHKRD_MASK_NOOFST << MML_GCR_SCON_CHKRD_OFST )

#define	MML_GCR_SCON_CHKRES_OFST				15
#define	MML_GCR_SCON_CHKRES_MASK_NOOFST			0x1
#define	MML_GCR_SCON_CHKRES_MASK				( MML_GCR_SCON_CHKRES_MASK_NOOFST << MML_GCR_SCON_CHKRES_OFST )
/** @} */ /* @defgroup MML_GCR_SCON */

/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_RSTR Reset Register (RSTR)
 *
 * @{
 */

#define MML_GCR_RSTR_OFST						0x00000004 //!< Reset register offset
#define MML_GCR_RSTR_DFLT						0x00000000 //!< Reset register default value

#define	MML_GCR_RSTR_DMA_OFST					0
#define	MML_GCR_RSTR_DMA_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_DMA_MASK					( MML_GCR_RSTR_DMA_MASK_NOOFST << MML_GCR_RSTR_DMA_OFST )

#define	MML_GCR_RSTR_WDT_OFST					1
#define	MML_GCR_RSTR_WDT_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_WDT_MASK					( MML_GCR_RSTR_WDT_MASK_NOOFST << MML_GCR_RSTR_WDT_OFST )

#define	MML_GCR_RSTR_GPIO_OFST					2
#define	MML_GCR_RSTR_GPIO_MASK_NOOFST			0x7
#define	MML_GCR_RSTR_GPIO_MASK					( MML_GCR_RSTR_GPIO_MASK_NOOFST << MML_GCR_RSTR_GPIO_OFST )

/** bit5 - bit10, bit24 & bit27  */
#define	MML_GCR_RSTR_TIMER0_OFST				5
#define	MML_GCR_RSTR_TIMER0_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER0_MASK				( MML_GCR_RSTR_TIMER0_MASK_NOOFST << MML_GCR_RSTR_TIMER0_OFST )

#define	MML_GCR_RSTR_TIMER1_OFST				6
#define	MML_GCR_RSTR_TIMER1_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER1_MASK				( MML_GCR_RSTR_TIMER1_MASK_NOOFST << MML_GCR_RSTR_TIMER1_OFST )

#define	MML_GCR_RSTR_TIMER2_OFST				7
#define	MML_GCR_RSTR_TIMER2_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER2_MASK				( MML_GCR_RSTR_TIMER2_MASK_NOOFST << MML_GCR_RSTR_TIMER2_OFST )

#define	MML_GCR_RSTR_TIMER3_OFST				8
#define	MML_GCR_RSTR_TIMER3_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER3_MASK				( MML_GCR_RSTR_TIMER3_MASK_NOOFST << MML_GCR_RSTR_TIMER3_OFST )

