quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_gcr_regs.h
#define	MML_GCR_RSTR_TIMER4_OFST				9
#define	MML_GCR_RSTR_TIMER4_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER4_MASK				( MML_GCR_RSTR_TIMER4_MASK_NOOFST << MML_GCR_RSTR_TIMER4_OFST )

#define	MML_GCR_RSTR_TIMER5_OFST				10
#define	MML_GCR_RSTR_TIMER5_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER5_MASK				( MML_GCR_RSTR_TIMER5_MASK_NOOFST << MML_GCR_RSTR_TIMER5_OFST )

#define	MML_GCR_RSTR_UART0_OFST					11
#define	MML_GCR_RSTR_UART0_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_UART0_MASK					( MML_GCR_RSTR_UART0_MASK_NOOFST << MML_GCR_RSTR_UART0_OFST )

#define	MML_GCR_RSTR_UART1_OFST					12
#define	MML_GCR_RSTR_UART1_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_UART1_MASK					( MML_GCR_RSTR_UART1_MASK_NOOFST << MML_GCR_RSTR_UART1_OFST )

#define	MML_GCR_RSTR_SPI_OFST					13
#define	MML_GCR_RSTR_SPI_MASK_NOOFST			0x7
#define	MML_GCR_RSTR_SPI_MASK					( MML_GCR_RSTR_SPI_MASK_NOOFST << MML_GCR_RSTR_SPI_OFST )

#define	MML_GCR_RSTR_I2C_OFST					16
#define	MML_GCR_RSTR_I2C_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_I2C_MASK					( MML_GCR_RSTR_I2C_MASK_NOOFST << MML_GCR_RSTR_I2C_OFST )

#define	MML_GCR_RSTR_RTC_OFST					17
#define	MML_GCR_RSTR_RTC_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_RTC_MASK					( MML_GCR_RSTR_RTC_MASK_NOOFST << MML_GCR_RSTR_RTC_OFST )

#define	MML_GCR_RSTR_CRYPTO_OFST				18
#define	MML_GCR_RSTR_CRYPTO_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_CRYPTO_MASK				( MML_GCR_RSTR_CRYPTO_MASK_NOOFST << MML_GCR_RSTR_CRYPTO_OFST )

#define	MML_GCR_RSTR_MAGDSP_OFST				19
#define	MML_GCR_RSTR_MAGDSP_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_MAGDSP_MASK				( MML_GCR_RSTR_MAGDSP_MASK_NOOFST << MML_GCR_RSTR_MAGDSP_OFST )

#define	MML_GCR_RSTR_SC_OFST					20
#define	MML_GCR_RSTR_SC_MASK_NOOFST				0x1
#define	MML_GCR_RSTR_SC_MASK					( MML_GCR_RSTR_SC_MASK_NOOFST << MML_GCR_RSTR_SC_OFST )

#define	MML_GCR_RSTR_KBD_OFST					21
#define	MML_GCR_RSTR_KBD_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_KBD_MASK					( MML_GCR_RSTR_KBD_MASK_NOOFST << MML_GCR_RSTR_KBD_OFST )

#define	MML_GCR_RSTR_TFTLCD_OFST				22
#define	MML_GCR_RSTR_TFTLCD_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TFTLCD_MASK				( MML_GCR_RSTR_TFTLCD_MASK_NOOFST << MML_GCR_RSTR_TFTLCD_OFST )

#define	MML_GCR_RSTR_USB_OFST					23
#define	MML_GCR_RSTR_USB_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_USB_MASK					( MML_GCR_RSTR_USB_MASK_NOOFST << MML_GCR_RSTR_USB_OFST )

#define	MML_GCR_RSTR_TIMER6_OFST				24
#define	MML_GCR_RSTR_TIMER6_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER6_MASK				( MML_GCR_RSTR_TIMER6_MASK_NOOFST << MML_GCR_RSTR_TIMER6_OFST )

#define	MML_GCR_RSTR_ADC_OFST					25
#define	MML_GCR_RSTR_ADC_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_ADC_MASK					( MML_GCR_RSTR_ADC_MASK_NOOFST << MML_GCR_RSTR_ADC_OFST )

#define	MML_GCR_RSTR_DAC_OFST					26
#define	MML_GCR_RSTR_DAC_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_DAC_MASK					( MML_GCR_RSTR_DAC_MASK_NOOFST << MML_GCR_RSTR_DAC_OFST )

#define	MML_GCR_RSTR_TIMER7_OFST				27
#define	MML_GCR_RSTR_TIMER7_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_TIMER7_MASK				( MML_GCR_RSTR_TIMER7_MASK_NOOFST << MML_GCR_RSTR_TIMER7_OFST )

#define	MML_GCR_RSTR_UART2_OFST					28
#define	MML_GCR_RSTR_UART2_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_UART2_MASK					( MML_GCR_RSTR_UART2_MASK_NOOFST << MML_GCR_RSTR_UART2_OFST )

#define	MML_GCR_RSTR_SRST_OFST					29
#define	MML_GCR_RSTR_SRST_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_SRST_MASK					( MML_GCR_RSTR_SRST_MASK_NOOFST << MML_GCR_RSTR_SRST_OFST )

#define	MML_GCR_RSTR_PRST_OFST					30
#define	MML_GCR_RSTR_PRST_MASK_NOOFST			0x1
#define	MML_GCR_RSTR_PRST_MASK					( MML_GCR_RSTR_PRST_MASK_NOOFST << MML_GCR_RSTR_PRST_OFST )

#define	MML_GCR_RSTR_SYSTEM_OFST				31 //!< System Reset bit offset
#define	MML_GCR_RSTR_SYSTEM_MASK_NOOFST			0x1u
#define	MML_GCR_RSTR_SYSTEM_MASK				( MML_GCR_RSTR_SYSTEM_MASK_NOOFST << MML_GCR_RSTR_SYSTEM_OFST ) //!< System Reset bit mask


#define	MML_GCR_RSTR_UARTS_MASK					( MML_GCR_RSTR_UART0_MASK |\
													MML_GCR_RSTR_UART1_MASK |\
													MML_GCR_RSTR_UART2_MASK )

#define	MML_GCR_RSTR_TIMERS_MASK				( MML_GCR_RSTR_TIMER0_MASK |\
													MML_GCR_RSTR_TIMER1_MASK |\
													MML_GCR_RSTR_TIMER2_MASK |\
													MML_GCR_RSTR_TIMER3_MASK |\
													MML_GCR_RSTR_TIMER4_MASK |\
													MML_GCR_RSTR_TIMER5_MASK |\
													MML_GCR_RSTR_TIMER6_MASK |\
													MML_GCR_RSTR_TIMER7_MASK )
/** @} */ /* @defgroup MML_GCR_RSTR */

/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_CLKCN Clock Control Register
 *
 * @li 0-2 HDIV [2:0]: AHB Bus Clock Divider.
 * @li 4-5 PDIV [2:0] Peripheral Bus Clock Divider.
 * @li 6-8 PSC [2:0]: Prescaler Select.
 * @li 9-11 CLKSEL [2:0]: Clock Source Select.
 * @li 13 CKRDY [0]: Clock Ready.
 * @li
 *
 *
 *
 * @{
 */
#define MML_GCR_CLKCN_OFST						0x00000008 //!< Clock Control register offset
#define MML_GCR_CLKCN_DFLT						0x00000000 //!< Clock Control register default value

#define MML_GCR_CLKCN_PSC_OFST					6 //!< PSC bits offset
#define MML_GCR_CLKCN_PSC_MASK_NOOFST			0x7 //!< PSC bits offset
#define MML_GCR_CLKCN_PSC_MASK					( MML_GCR_CLKCN_PSC_MASK_NOOFST << MML_GCR_CLKCN_PSC_OFST )

#define MML_GCR_CLKCN_CLKSEL_OFST				9 //!< CLKSEL bits offset
#define MML_GCR_CLKCN_CLKSEL_MASK_NOOFST		0x7 //!< CLKSEL bits offset
#define MML_GCR_CLKCN_CLKSEL					( MML_GCR_CLKCN_CLKSEL_MASK_NOOFST << MML_GCR_CLKCN_CLKSEL_OFST )

#define MML_GCR_CLKCN_CKRDY_OFST				13 //!< CKRDY bits offset
#define MML_GCR_CLKCN_CKRDY_MASK_NOOFST			0x1 //!< CKRDY bits offset
#define MML_GCR_CLKCN_CKRDY_MASK				( MML_GCR_CLKCN_CKRDY_MASK_NOOFST << MML_GCR_CLKCN_CKRDY_OFST )

/** @} */ /* @defgroup MML_GCR_CLKCN */

/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_PM Power Management Register (PMR)
 *
 * @{
 */

#define MML_GCR_PM_OFST							0x0000000c //!< Power Mode register offset
#define MML_GCR_PM_DFLT							0x00000000 //!< Power Mode register default value

//PMR reg
#define MML_GCR_PM_MODE_OFST					0 //!< Power Mode Mode bits offset
#define MML_GCR_PM_MODE_MASK_NOOFST				0x3 //!< Power Mode Mode bits mask
#define MML_GCR_PM_MODE_MASK					( MML_GCR_PMR_MODE_MASK_NOOFST << MML_GCR_PMR_MODE_OFST ) //!< Power Mode Mode bits mask

#define	MML_GCR_PM_GPIOWKEN_OFST				4
#define	MML_GCR_PM_GPIOWKEN_MASK_NOOFST			0x1
#define	MML_GCR_PM_GPIOWKEN_MASK				( MML_GCR_PM_GPIOWKEN_MASK_NOOFST << MML_GCR_PM_GPIOWKEN_OFST )

#define	MML_GCR_PM_RTCWKEN_OFST					5
#define	MML_GCR_PM_RTCWKEN_MASK_NOOFST			0x1
#define	MML_GCR_PM_RTCWKEN_MASK					( MML_GCR_PM_RTCWKEN_MASK_NOOFST << MML_GCR_PM_RTCWKEN_OFST )

#define	MML_GCR_PM_USBWKEN_OFST					6
#define	MML_GCR_PM_USBWKEN_MASK_NOOFST			0x1
#define	MML_GCR_PM_USBWKEN_MASK					( MML_GCR_PM_USBWKEN_MASK_NOOFST << MML_GCR_PM_USBWKEN_OFST )

#define	MML_GCR_PM_SCWKEN_OFST					7
#define	MML_GCR_PM_SCWKEN_MASK_NOOFST			0x1
#define	MML_GCR_PM_SCWKEN_MASK					( MML_GCR_PM_SCWKEN_MASK_NOOFST << MML_GCR_PM_SCWKEN_OFST )

#define	MML_GCR_PM_OSCPD_OFST					12
#define	MML_GCR_PM_OSCPD_MASK_NOOFST			0x1
#define	MML_GCR_PM_OSCPD_MASK					( MML_GCR_PM_OSCPD_MASK_NOOFST << MML_GCR_PM_OSCPD_OFST )

#define	MML_GCR_PM_PLL01PD_OFST					13
#define	MML_GCR_PM_PLL01PD_MASK_NOOFST			0x1
#define	MML_GCR_PM_PLL01PD_MASK					( MML_GCR_PM_PLL01PD_MASK_NOOFST << MML_GCR_PM_PLL01PD_OFST )

#define	MML_GCR_PM_COPD_OFST					14
#define	MML_GCR_PM_COPD_MASK_NOOFST				0x1
#define	MML_GCR_PM_COPD_MASK					( MML_GCR_PM_COPD_MASK_NOOFST << MML_GCR_PM_COPD_OFST )

