quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_gcr_regs.h
#define	MML_GCR_PM_CM3PMUEN_OFST				16
#define	MML_GCR_PM_CM3PMUEN_MASK_NOOFST			0x1
#define	MML_GCR_PM_CM3PMUEN_MASK				( MML_GCR_PM_CM3PMUEN_MASK_NOOFST << MML_GCR_PM_CM3PMUEN_OFST )

#define	MML_GCR_PM_CM3WICACK_OFST				17
#define	MML_GCR_PM_CM3WICACK_MASK_NOOFST		0x1
#define	MML_GCR_PM_CM3WICACK_MASK				( MML_GCR_PM_CM3WICACK_MASK_NOOFST << MML_GCR_PM_CM3WICACK_OFST )

#define MML_GCR_PM_MODE_ACTIVE					0x0
#define MML_GCR_PM_MODE_IDLE					0x1
#define MML_GCR_PM_MODE_STANDBY					0x2
#define MML_GCR_PM_MODE_SHUTDOWN				0x3
/** @} */ /* @defgroup MML_GCR_PM */

/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_PLL0CN PLL0 Control Register (PLL0CN)
 *
 * @{
 */
#define MML_GCR_PLL0CN_OFST						0x00000010 //!< PLL Control Register offset
#define MML_GCR_PLL0CN_DFLT						0x00000000 //!< PLL Control Register default value

#define	MML_GCR_PLL0CN_PLL0EN_OFST				0
#define	MML_GCR_PLL0CN_PLL0EN_MASK_NOOFST		0x1
#define	MML_GCR_PLL0CN_PLL0EN_MASK				( MML_GCR_PLL0CN_PLL0EN_MASK_NOOFST << MML_GCR_PLL0CN_PLL0EN_OFST )

#define	MML_GCR_PLL0CN_PLL0LOCK_OFST			1
#define	MML_GCR_PLL0CN_PLL0LOCK_MASK_NOOFST		0x1
#define	MML_GCR_PLL0CN_PLL0LOCK_MASK			( MML_GCR_PLL0CN_PLL0LOCK_MASK_NOOFST << MML_GCR_PLL0CN_PLL0LOCK_OFST )
/** @} */ /* @defgroup MML_GCR_PLLCN */

/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_PLL1CN PLL1 Control Register (PLL1CN)
 *
 * @{
 */
#define MML_GCR_PLL1CN_OFST						0x00000014 //!< PLL Control Register offset
#define MML_GCR_PLL1CN_DFLT						0x00000000 //!< PLL Control Register default value

#define	MML_GCR_PLL1CN_PLL1EN_OFST				0
#define	MML_GCR_PLL1CN_PLL1EN_MASK_NOOFST		0x1
#define	MML_GCR_PLL1CN_PLL1EN_MASK				( MML_GCR_PLL1CN_PLL1EN_MASK_NOOFST << MML_GCR_PLL1CN_PLL1EN_OFST )

#define	MML_GCR_PLL1CN_PLL1LOCK_OFST			1
#define	MML_GCR_PLL1CN_PLL1LOCK_MASK_NOOFST		0x1
#define	MML_GCR_PLL1CN_PLL1LOCK_MASK			( MML_GCR_PLL1CN_PLL1LOCK_MASK_NOOFST << MML_GCR_PLL1CN_PLL1LOCK_OFST )
/** @} */ /* @defgroup MML_GCR_PLLCN */


/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_PCKDIV
 *
 * @{
 */
#define MML_GCR_PCKDIV_OFST						0x00000018 //!< PCKDIV register offset
#define MML_GCR_PCKDIV_DFLT						0x00000001 //!< PCKDIV register default value

#define MML_GCR_PCKDIV_PCF_OFST					0
#define MML_GCR_PCKDIV_PCF_MASK_NOOFST			0x7
#define MML_GCR_PCKDIV_PCF_MASK					( MML_GCR_PCKDIV_PCF_MASK_NOOFST << MML_GCR_PCKDIV_PCF_OFST )
/** @} */ /* @defgroup MML_GCR_PCKDIV */

/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_PERCKCN GCR Peripheral Clock Disable Register
 *
 * @{
 */

#define MML_GCR_PERCKCN_OFST					0x00000024 //!< PERCKCN register offset
#define MML_GCR_PERCKCN_DFLT					0x00000000 //!< PERCKCN register default value

#define MML_GCR_PERCKCN_GPIOxD_OFST				0
#define MML_GCR_PERCKCN_GPIOxD_MASK_NOOFST		0x7
#define MML_GCR_PERCKCN_GPIOxD_MASK				( MML_GCR_PERCKCN_GPIOxD_MASK_NOOFST << MML_GCR_PERCKCN_GPIOxD_OFST )

#define MML_GCR_PERCKCN_USBD_OFST				3
#define MML_GCR_PERCKCN_USBD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_USBD_MASK				( MML_GCR_PERCKCN_USBD_MASK_NOOFST << MML_GCR_PERCKCN_USBD_OFST )

#define MML_GCR_PERCKCN_UART2D_OFST				4
#define MML_GCR_PERCKCN_UART2D_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_UART2D_MASK				( MML_GCR_PERCKCN_UART2D_MASK_NOOFST << MML_GCR_PERCKCN_UART2D_OFST )

#define MML_GCR_PERCKCN_DMAD_OFST				5
#define MML_GCR_PERCKCN_DMAD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_DMAD_MASK				( MML_GCR_PERCKCN_DMAD_MASK_NOOFST << MML_GCR_PERCKCN_DMAD_OFST )

#define MML_GCR_PERCKCN_SPIxD_OFST				6
#define MML_GCR_PERCKCN_SPIxD_MASK_NOOFST		0x7
#define MML_GCR_PERCKCN_SPIxD_MASK				( MML_GCR_PERCKCN_SPIxD_MASK_NOOFST << MML_GCR_PERCKCN_SPIxD_OFST )

#define MML_GCR_PERCKCN_UART0D_OFST				9
#define MML_GCR_PERCKCN_UART0D_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_UART0D_MASK				( MML_GCR_PERCKCN_UART0D_MASK_NOOFST << MML_GCR_PERCKCN_UART0D_OFST )

#define MML_GCR_PERCKCN_UART1D_OFST				10
#define MML_GCR_PERCKCN_UART1D_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_UART1D_MASK				( MML_GCR_PERCKCN_UART1D_MASK_NOOFST << MML_GCR_PERCKCN_UART1D_OFST )

#define MML_GCR_PERCKCN_MAGDSPD_OFST			11
#define MML_GCR_PERCKCN_MAGDSPD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_MAGDSPD_MASK			( MML_GCR_PERCKCN_MAGDSPD_MASK_NOOFST << MML_GCR_PERCKCN_MAGDSPD_OFST )

#define MML_GCR_PERCKCN_SCD_OFST				12
#define MML_GCR_PERCKCN_SCD_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_SCD_MASK				( MML_GCR_PERCKCN_SCD_MASK_NOOFST << MML_GCR_PERCKCN_SCD_OFST )

#define MML_GCR_PERCKCN_I2CD_OFST				13
#define MML_GCR_PERCKCN_I2CD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_I2CD_MASK				( MML_GCR_PERCKCN_I2CD_MASK_NOOFST << MML_GCR_PERCKCN_I2CD_OFST )

#define MML_GCR_PERCKCN_CRYPTOD_OFST			14
#define MML_GCR_PERCKCN_CRYPTOD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_CRYPTOD_MASK			( MML_GCR_PERCKCN_CRYPTOD_MASK_NOOFST << MML_GCR_PERCKCN_CRYPTOD_OFST )

#define MML_GCR_PERCKCN_T0D_OFST				15
#define MML_GCR_PERCKCN_T0D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T0D_MASK				( MML_GCR_PERCKCN_T0D_MASK_NOOFST << MML_GCR_PERCKCN_T0D_OFST )

#define MML_GCR_PERCKCN_T1D_OFST				16
#define MML_GCR_PERCKCN_T1D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T1D_MASK				( MML_GCR_PERCKCN_T1D_MASK_NOOFST << MML_GCR_PERCKCN_T1D_OFST )

#define MML_GCR_PERCKCN_T2D_OFST				17
#define MML_GCR_PERCKCN_T2D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T2D_MASK				( MML_GCR_PERCKCN_T2D_MASK_NOOFST << MML_GCR_PERCKCN_T2D_OFST )

#define MML_GCR_PERCKCN_T3D_OFST				18
#define MML_GCR_PERCKCN_T3D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T3D_MASK				( MML_GCR_PERCKCN_T3D_MASK_NOOFST << MML_GCR_PERCKCN_T3D_OFST )

#define MML_GCR_PERCKCN_T4D_OFST				19
#define MML_GCR_PERCKCN_T4D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T4D_MASK				( MML_GCR_PERCKCN_T4D_MASK_NOOFST << MML_GCR_PERCKCN_T4D_OFST )

#define MML_GCR_PERCKCN_T5D_OFST				20
#define MML_GCR_PERCKCN_T5D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T5D_MASK				( MML_GCR_PERCKCN_T5D_MASK_NOOFST << MML_GCR_PERCKCN_T5D_OFST )

#define MML_GCR_PERCKCN_MLCDD_OFST				21
#define MML_GCR_PERCKCN_MLCDD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_MLCDD_MASK				( MML_GCR_PERCKCN_MLCDD_MASK_NOOFST << MML_GCR_PERCKCN_MLCDD_OFST )

#define MML_GCR_PERCKCN_KBDD_OFST				22
#define MML_GCR_PERCKCN_KBDD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_KBDD_MASK				( MML_GCR_PERCKCN_KBDD_MASK_NOOFST << MML_GCR_PERCKCN_KBDD_OFST )

