quanguoheme/hdx_1.1/drivers/max3255X/include/dev/mml_gcr_regs.h
#define MML_GCR_PERCKCN_ADCD_OFST				23
#define MML_GCR_PERCKCN_ADCD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_ADCD_MASK				( MML_GCR_PERCKCN_ADCD_MASK_NOOFST << MML_GCR_PERCKCN_ADCD_OFST )

#define MML_GCR_PERCKCN_DACD_OFST				24
#define MML_GCR_PERCKCN_DACD_MASK_NOOFST		0x1
#define MML_GCR_PERCKCN_DACD_MASK				( MML_GCR_PERCKCN_DACD_MASK_NOOFST << MML_GCR_PERCKCN_DACD_OFST )

#define MML_GCR_PERCKCN_T6D_OFST				26
#define MML_GCR_PERCKCN_T6D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T6D_MASK				( MML_GCR_PERCKCN_T6D_MASK_NOOFST << MML_GCR_PERCKCN_T6D_OFST )

#define MML_GCR_PERCKCN_T7D_OFST				27
#define MML_GCR_PERCKCN_T7D_MASK_NOOFST			0x1
#define MML_GCR_PERCKCN_T7D_MASK				( MML_GCR_PERCKCN_T7D_MASK_NOOFST << MML_GCR_PERCKCN_T7D_OFST )

#define	MML_GCR_PERCKCN_UARTxD_MASK				( MML_GCR_PERCKCN_UART0D_MASK |\
													MML_GCR_PERCKCN_UART1D_MASK |\
													MML_GCR_PERCKCN_UART2D_MASK )

#define	MML_GCR_PERCKCN_TxD_MASK				( MML_GCR_PERCKCN_T0D_MASK |\
													MML_GCR_PERCKCN_T1D_MASK |\
													MML_GCR_PERCKCN_T2D_MASK |\
													MML_GCR_PERCKCN_T3D_MASK |\
													MML_GCR_PERCKCN_T4D_MASK |\
													MML_GCR_PERCKCN_T5D_MASK |\
													MML_GCR_PERCKCN_T6D_MASK |\
													MML_GCR_PERCKCN_T7D_MASK )

/** @} */ /* @defgroup MML_GCR_PERCKCN */

/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_MEMZCN GCR Memory Zero-ize Control Register
 *
 * @{
 */

#define MML_GCR_MEMZCN_OFST						0x0000002c //!< MEMZCN register offset
#define MML_GCR_MEMZCN_DFLT						0x00000000 //!< MEMZCN register default value

#define MML_GCR_MEMZCN_SRAMx_OFST				0
#define MML_GCR_MEMZCN_SRAMx_MASK_NOOFST		0x3
#define MML_GCR_MEMZCN_SRAMx_MASK				( MML_GCR_MEMZCN_SRAMx_MASK_NOOFST << MML_GCR_MEMZCN_SRAMx_OFST )

#define MML_GCR_MEMZCN_NVSRAM_OFST				2
#define MML_GCR_MEMZCN_NVSRAM_MASK_NOOFST		0x1
#define MML_GCR_MEMZCN_NVSRAM_MASK				( MML_GCR_MEMZCN_NVSRAM_MASK_NOOFST << MML_GCR_MEMZCN_NVSRAM_OFST )

#define MML_GCR_MEMZCN_ICACHE_OFST				3
#define MML_GCR_MEMZCN_ICACHE_MASK_NOOFST		0x1
#define MML_GCR_MEMZCN_ICACHE_MASK				( MML_GCR_MEMZCN_ICACHE_MASK_NOOFST << MML_GCR_MEMZCN_ICACHE_OFST )

#define MML_GCR_MEMZCN_CRYPTO_OFST				5
#define MML_GCR_MEMZCN_CRYPTO_MASK_NOOFST		0x1
#define MML_GCR_MEMZCN_CRYPTO_MASK				( MML_GCR_MEMZCN_CRYPTO_MASK_NOOFST << MML_GCR_MEMZCN_CRYPTO_OFST )
/** @} */ /* @defgroup MML_GCR_MEMZCN */


/* -------------------------------------------------------------------------- */
/** @defgroup MML_GCR_SCCK GCR Smart Card Clock Control Register
 *
 * @{
 */

#define MML_GCR_SCCK_OFST						0x00000034 //!< SCCK register offset
#define MML_GCR_SCCK_DFLT						0x0000000a //!< SCCK register default value

#define	MML_GCR_SCCK_SC0FRQ_OFST				0
#define	MML_GCR_SCCK_SC0FRQ_MASK_NOOFST			0x3f
#define	MML_GCR_SCCK_SC0FRQ_MASK				( MML_GCR_SCCK_SC0FRQ_MASK_NOOFST << MML_GCR_SCCK_SC0FRQ_OFST )
/** @} */ /* @defgroup MML_GCR_SCCK */

#ifndef __ASSEMBLER__
/* -------------------------------------------------------------------------- */

/** GCR Registers.
 *
 */
typedef volatile struct
{
	/** System Control Register - 0x00000000 */
	unsigned int								scon;
	/** Reset Register - 0x00000004 */
	unsigned int								rstr;
	/** Clock Control Register - 0x00000008 */
	unsigned int								clkcn;
	/** Power Management Register - 0x0000000c */
	unsigned int								pm;
	/** PLL0 Control Register - 0x00000010 */
	unsigned int								pll0cn;
	/** PLL1 Control Register - 0x00000014 */
	unsigned int								pll1cn;
	/** Peripheral clock divider - 0x00000018 */
	unsigned int								pckdiv;
	/** RFU - 0x0000001c - 20*/
	unsigned int								rfu0[2];
	/** Peripheral Clock Disable Register - 0x00000024 */
	unsigned int								perckcn;
	/** RFU - 0x00000028 */
	unsigned int								rfu1;
	/** Memory Zero-ize Control Register - 0x0000002c */
	unsigned int								memzcn;
	/** RFU - 0x00000030 */
	unsigned int								rfu2;
	/** Smart Card Clock Control Register - 0x00000034 */
	unsigned int								scck;

} mml_gcr_regs_t;

/** RSTR devices
 *
 */
typedef enum
{
    /**  */
    MML_RSTR_DEV_MIN = 0,
    MML_RSTR_DEV_DMA = MML_RSTR_DEV_MIN,
    MML_RSTR_DEV_WDT,
    MML_RSTR_DEV_GPIO0,
    MML_RSTR_DEV_GPIO1,
    MML_RSTR_DEV_GPIO2,
    MML_RSTR_DEV_TIMER0,
    MML_RSTR_DEV_TIMER1,
    MML_RSTR_DEV_TIMER2,
    MML_RSTR_DEV_TIMER3,
    MML_RSTR_DEV_TIMER4,
    MML_RSTR_DEV_TIMER5,
    MML_RSTR_DEV_UART0,
    MML_RSTR_DEV_UART1,
    MML_RSTR_DEV_SPI0,
    MML_RSTR_DEV_SPI1,
    MML_RSTR_DEV_SPI2,
    MML_RSTR_DEV_I2C,
    MML_RSTR_DEV_RTC,
    MML_RSTR_DEV_CRYPTO,
    MML_RSTR_DEV_MAGDSP,
    MML_RSTR_DEV_SC,
    MML_RSTR_DEV_KBD,
    MML_RSTR_DEV_LCD_TFT,
    MML_RSTR_DEV_USB_BD,
    MML_RSTR_DEV_TRNG_TIMER6,
    MML_RSTR_DEV_ADC,
    MML_RSTR_DEV_DAC,
    MML_RSTR_DEV_TIMER7,
    MML_RSTR_DEV_UART2,
    MML_RSTR_DEV_SRST,
    MML_RSTR_DEV_PRST,
    MML_RSTR_DEV_ALL,
    MML_RSTR_DEV_MAX = MML_RSTR_DEV_ALL,
    MML_RSTR_DEV_COUNT

} mml_rstr_dev_t;

/** PERCKCN devices
 *
 */
typedef enum
{
    MML_PERCKCN_DEV_MIN = 0, //!< MML_PERCKCN_DEV_MIN
    MML_PERCKCN_DEV_GPIO0 = MML_PERCKCN_DEV_MIN, //! Disables the GPIO0 clock.
    MML_PERCKCN_DEV_GPIO1, //! Disables the GPIO1 clock.
    MML_PERCKCN_DEV_GPIO2, //! Disables the GPIO2 clock.
    MML_PERCKCN_DEV_USB, //! Disables the USB clock.
    MML_PERCKCN_DEV_UART2, //! Disables the UART2 clock.
    MML_PERCKCN_DEV_DMA, //! Disables the DMA clock.
    MML_PERCKCN_DEV_SPI0, //! Disables the SPI0 clock.
    MML_PERCKCN_DEV_SPI1, //! Disables the SPI1 clock.
    MML_PERCKCN_DEV_SPI2, //! Disables the SPI2 clock.
    MML_PERCKCN_DEV_UART0, //! Disables the UART0 clock.
    MML_PERCKCN_DEV_UART1, //! Disables the UART1 clock.
    MML_PERCKCN_DEV_MAGDSP, //! Disables the MAGDSP clock.
    MML_PERCKCN_DEV_SC, //! Disables the SC clock.
    MML_PERCKCN_DEV_I2C, //! Disables the I²C clock.
    MML_PERCKCN_DEV_CRYPTO, //! Disables the Crypto clock.
    MML_PERCKCN_DEV_T0, //! Disables the Timer 0 clock.
    MML_PERCKCN_DEV_T1, //! Disables the Timer 1 clock.
    MML_PERCKCN_DEV_T2, //! Disables the Timer 2 clock.
    MML_PERCKCN_DEV_T3, //! Disables the Timer 3 clock.
    MML_PERCKCN_DEV_T4, //! Disables the Timer 4 clock.
    MML_PERCKCN_DEV_T5, //! Disables the Timer 5 clock.
    MML_PERCKCN_DEV_MLCD, //! Disables the MLCD clock.
    MML_PERCKCN_DEV_KBD, //! Disables the KBD clock.
    MML_PERCKCN_DEV_ADC, //! Disables the ADC clock.
    MML_PERCKCN_DEV_DAC, //! Disables the DAC clock.
    MML_PERCKCN_DEV_T6, //! Disables the Timer 6 clock.
    MML_PERCKCN_DEV_T7, //! Disables the Timer 7 clock.
    MML_PERCKCN_DEV_MAX = MML_PERCKCN_DEV_DAC, //!< MML_PERCKCN_DEV_MAX
    MML_PERCKCN_DEV_COUNT //!< MML_PERCKCN_DEV_COUNT

} mml_perckcn_dev_t;

/** System Frequencies
 *
 */
typedef enum
{
    MML_GCR_DIV_1 = 0x0,
    MML_GCR_DIV_2,
    MML_GCR_DIV_4,
    MML_GCR_DIV_8,
    MML_GCR_DIV_16,
    MML_GCR_DIV_32,
    MML_GCR_DIV_64,
    MML_GCR_DIV_128

} mml_gcr_sysfreq_t;


#endif /* __ASSEMBLER__ */

/** @} */ /* @defgroup MML_GCR_REGS */

#endif /* _MML_GCR_REGS_H_ */

/******************************************************************************/
/* EOF */
